<template>
    <div class="container">
        <div class="row">
            <div class="col-md-12">
                <div>
                    <h1> Вакансии : </h1>
                    <div>
                        <b>Работа в Lucky-bet</b>
                        <br>
                        Вы хотите работать в ведущей букмекерской компании России и можете предложить нам свои знания и опыт?

                        В связи с расширением компании и открытием новых центров обслуживания клиентов мы приглашаем на работу в Москве и регионах РФ на следующие вакансии:

                        Официант

                        Заместитель управ⁢ляющего сети клубов (г. Уфа)

                        Заместитель управ⁢ляющего сети клубов (г.Киров)

                        Заместитель управ⁢ляющего сети клубов (г. Казань)

                        Заместитель управ⁢ляющего сети клубов (г. Краснодар)

                        Управляющий сети клубов (г. Калуга)

                        Управляющий сети клубов (г. Рязань)

                        Кассир

                        Управляющий сети клубов

                        Специалист по охране труда

                        Тренинг-⁢менеджер

                        Ведущий юрист корпоративного отдела

                        Консультант SAP CRM

                        Специалист технической поддержки

                        Менеджер по монетизации

                        Региональный менеджер по рекламе

                        Помощник руководителя

                        Бухгалтер по расчету заработной платы

                        Специалист отдела обработки данных (в финансовый отдел)

                        Комментатор спортивных событий

                        Спортивный аналитик live

                        Оператор call-центра

                    </div>
                    <div>
                        <router-link to="/"> Take Me Home </router-link>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>

</script>

<style>

</style>