<template>
    <div class="container">
        <div class="row">
            <div class="col-md-12">
                <div>
                    <h1> О нас : </h1>
                    <div>
                        LuckyBet является новым брендом хорошо известной всем любителям спортивных ставок букмекерской конторы Ф.О.Н.
                        БК Ф.О.Н. – старейшая и одна из самых крупных в России и на территории бывшего СССР букмекерская контора. Букмекерская контора LuckyBet (БК LuckyBet) принимает ставки на спортивные события в России и во всем мире по многим видам спорта: футбол, хоккей, баскетбол, теннис, зимние виды спорта, шахматы и многое другое.
                        Контора была основана в Москве, открыв летом 1994 года свой первый пункт приема ставок в районе м. 1905 года. Начав практически с нуля, сотрудники БК Ф.О.Н. сумели за несколько лет выйти на лидирующие позиции в букмекерском бизнесе в России. Квалифицированный менеджмент и ответственное отношение к делу позволял фирме сохранять свои позиции в тяжелые времена финансовых кризисов, и успешно развиваться в благоприятные экономические периоды.
                        Результат налицо: в настоящее время букмекерская контора LuckyBet насчитывает более 100 букмекерских клубов в г. Москве, отделения конторы работают в городах 82 регионов России, прием ставок по линии БК LuckyBet производится в ряде стран СНГ.
                        БК LuckyBet следит за современными тенденциями в букмекерской индустрии, подчас являясь их законодателем. В 2002 году БК ФОН одной из первых начала прием ставок LIVE прямо по ходу матчей. В 2011 году в работу пунктов было внедрено другое новшество, ставкоматы – автоматические устройства, которые позволяют клиентам быстро и без очереди сделать ставки и поработать со своим персональным счетом. Сейчас ставкоматы, оснащенные собственной разработкой БК LuckyBet, "ФОНАПС", являются основным инструментом, который используется игроками, чтобы поставить свои ставки.
                        В 2016 году LuckyBet начал прием ставок через сеть интернет на сайте, а также через мобильные приложения для iOS и Android.
                        На 2017 год количество сотрудников составляет более 4000 человек.
                        Букмекерскую контору LuckyBet характеризует хороший сервис и безупречная репутация среди игроков - благодаря финансовой дисциплине и высокой квалификации персонала контора никогда не допускает задержек с выплатами выигрышей.
                        Понимая важную роль бизнеса в улучшении благосостояния страны, чувствуя ответственность перед государством и своими клиентами, контора серьезно относится к соблюдению достаточно жесткого законодательства, а своими весомыми налоговыми отчислениями и участием в спонсорских проектах способствует развитию социальной сферы страны, и, конечно же, популяризации и продвижению физкультуры и спорта.
                        В последние годы БК LuckyBet постоянно выступает спонсором различных чемпионатов. LuckyBet является титульным спонсором Футбольной национальной лиги (ФНЛ), Профессиональной футбольной лиги (ПФЛ) и Чемпионата России по мини-футболу (АМФР Суперлига). Контора является спонсором команды по экстремальному автоспорту ФОНБЕТ Trophy.
                        Политика букмекеров БК LuckyBet – надежность и респектабельность. Не вступая в ценовые войны, и не ведя агрессивную рекламную политику, контора делает ставку на безупречный сервис, исключительно широкий выбор событий и видов ставок, а также на моментальные взаиморасчеты со своими клиентами.
                        В рамках поддержки борьбы за честную игру, БК LuckyBet подписала партнерские соглашения с рядом спортивных организаций. Такие соглашения заключены с КХЛ, ПФЛ, РФБ (Российская федерация баскетбола), АСБ (Ассоциация студенческого баскетбола). БК LuckyBet является сертифицированным участником международной организации Federbet по предупреждению договорных матчей.
                        Букмекерская контора LuckyBet видит свою цель в одном – организовать сервис спортивных ставок так, чтобы клиенты развивали интерес к спорту, имели возможность применить опыт, знания и интуицию и получали удовольствие от игры.
                    </div>
                    <div>
                        <router-link to="/"> Take Me Home </router-link>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>

</script>

<style>

</style>