<template>
    <div class="container">
        <div class="row">
            <div class="col-md-12">
                <div>
                    <h1> Как делать ставки : </h1>
                    <div>
                        Ставки на фактический исход. Можно сделать ставки на матчи без учета форы, если указаны соответствующие коэффициенты (на первой позиции – за выигрыш первой команды («1»), на второй позиции – коэффициент за ничью («Х»), на третьей позиции – коэффициент за выигрыш второй команды («2»). В этом случае, исходом ставки является фактический результат матча. Также можно сделать ставку на то, что 1-я команда не проиграет («1X»), 2-я команда не проиграет («X2») или не будет ничьей («12»).

                        Ставки на победу каждой из команд в матче с учетом форы (гандикапа). Фора определяется букмекерской конторой и может быть положительной, отрицательной или равной нулю. Для определения результата ставки к фактически забитым голам команды, на которую сделана ставка, отнимается (если фора отрицательная) или прибавляется (если фора положительная) фора на выбранную команду (фора на вторую команду во внимание не принимается). Если после этого результат матча получается в пользу выбранной команды, то ставка считается выигранной. В случае ничейного результата – ставка возвращается.

                        Например, если на первую команду установлена отрицательная фора «-1», и матч закончился:

                        а) со счетом 0:0, ставка проиграна;

                        б) со счетом 1:0, ставка возвращается;

                        в) со счетом 2:0, ставка выиграна.

                        A если установлена положительная фора «+0.5» и матч закончился:

                        а) со счетом 0:1, ставка проиграна;

                        б) со счетом 0:0 или 1:0, ставка выиграна.

                        Азиатский гандикап. Ставка на победу или тотал с учетом форы (гандикапа), кратного 0.25 (но не кратного 0.5). Такая ставка рассчитывается, как две ставки в размере половины суммы, с одинаковыми коэффициентами, и с ближайшими значениями «обычных фор» и «обычных тоталов» (целочисленными, или кратными 0.5). Такие события в линии помечаются префиксом «Asian». В случае если ставка с азиатским гандикапом включена в экспресс или систему, то при расчете этой ставки используется коэффициент выигрыша, который бы получился при ее расчете в одинаре. В случае выигрыша обеих половинных ставок при расчетах учитывается коэффициент ставки (К). Если одна половинная ставка выиграла, а по другой расход, в расчете принимается коэффициент (К+1)/2. Если одна половинная ставка проиграла, а по другой расход, в экспрессах считается коэффициент 0.5. Если обе половинные ставки проиграны, то вся ставка считается проигранной.

                        Ставки на общее количество голов или очков в матче («Больше – Меньше»). Количество голов называется «тотал» и определяется конторой. В случае попадания в тотал ставка возвращается.

                        Ставки на победу в соревнованиях или выход в следующий круг турниров. Если заявленный в соревновании участник по какой-либо причине не смог начать соревнование, ставки на этого участника подлежат возврату. В случае если два или более участника поделили победу в соревновании, выигрыш на каждого из них выплачивается исходя из коэффициента выигрыша, рассчитанного по формуле К=(Кисх-1)/N+1, где Кисх - исходный коэффициент на участника, N - количество победителей соревнования.

                        Ставки на конкретный счет матча и тайм-матч. В ставке вида «тайм-матч» необходимо угадать одновременно исход первого тайма и всего матча. В линии для обозначения этих исходов используются начальные буквы: П – победа, Н – ничья, при этом на первом месте ставится исход 1-го тайма, а на втором – матча. Исход 2-го тайма для расчета этой ставки значения НЕ имеет. Например, если матч закончился со счетом 1:1, а первый тайм 1:0, то выигрывает исход «П1Н».

                        Ставки на статистику тура или игрового дня. В случае если в туре признан несостоявшимся (по критериям п.4.3) или отменен (по критериям п 4.1) хотя бы один матч, то ставки на туровую статистику подлежат возврату, кроме ставок, результат которых однозначно определен (например, будет ли ничья 0:0, все команды забьют и т.п.). Букмекерская контора вправе принять решение о возврате ставок на статистику тура или игрового дня в случае появления достоверной информации об отмене одного из матчей до начала тура, о чем Клиенты информируются в официальных результатах конторы. Для расчета показателей на игровой день теннисных матчей игроку, который не доиграл матч (по любой причине), во всех оставшихся сетах и геймах засчитывается поражение. Хозяевами считаются команды или игроки, указанные в линии на первом месте.

                        Ставки на чет или нечет общего количества голов или очков в матче. Коэффициенты указаны в линии. Счет 0:0 – чет.

                        Ставки на индивидуальные показатели или сравнения игроков(участников). Если игрок не выходил на поле (не участвовал), то ставки на события с его участием подлежат возврату. Для участников, которые стартовали, но не закончили событие, расчет показателей производится по фактическому результату на момент снятия(схода), и для целей расчета таким участникам присваивается последнее место в итоговом протоколе. Ставки «будет ли хет-трик» считаются выигранными, если игрок забил три или более гола. Ставки «будет ли дубль» считаются выигранными, если игрок забил два или более гола. В ставках на показатели игроков голы, забитые игроком в свои ворота, в его показателях не учитываются. В ставках, относящихся к командной результативности, голы, забитые командой в свои ворота, учитываются как забитые ее оппонентом. Особенности расчета ставок на показатели игрока в футболе указаны в п. 6.4. Особенности расчета ставок на показатели игрока в теннисе указаны в п. 10.3. В неигровых видах спорта (легкая атлетика и т.д.) в сравнениях «Кто выше» если участник (для эстафеты – команда) стартовал, но не финишировал, то ставки на него в сравнении с другим участником проигрывают. Если оба участника сошли с дистанции или один из участников не стартовал – возврат ставок.

                        Ставки на исход таймов, периодов, четвертей и т.п. В случае если событие было признано несостоявшимся, но первый тайм (период и т.п.) завершился, то ставки на первый тайм рассчитываются в обычном порядке, даже если ставки на событие в целом подлежат возврату.

                        Ставки на время, когда произойдет то или иное событие, например, время 1-го гола, время 1-й ж/карты, время лидирования одной из команд и т.д. Предлагается угадать порядковую минуту, на которой произойдет событие. Точное время для расчета таких ставок определяется без учета секунд. Например, время 1-го гола, если первый гол забит, когда с начала матча прошло 00мин 10сек – «1-я минута», 04мин 10сек – «5-я минута», 04мин 59сек – «5-я минута», 05мин 00сек – «6-я минута».

                        Ставки на показатели, выраженные в процентах (% первой подачи, % владения мячом и т.д.) Для расчета берется значение показателя c официального сайта, округленное до целого по правилам арифметики.

                        Ставки на количество одного показателя (п1), которые будут предшествовать наступлению другого показателя (п2). Например, «количество ударов в створ до первого гола», «количество фолов до первой ж/карты» и т.п. Удар в створ, с которого забит гол, или фол, за который дали ж/карту, считается. Если голов или ж/карт не было, то результатом является общее количество показателей п1 (т.е. общее кол-во ударов в створ или фолов).
                    </div>
                    <div>
                        <router-link to="/"> Take Me Home </router-link>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>

</script>

<style>

</style>